# Найдите сумму цифр трехзначного числа.

# *Пример:*

# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)


N = int(input('Введите число -> '))

Sum = 0
while (N > 0):
        Sum += N % 10
        N //= 10
print (Sum)